[
  {
    "title": "C-23-M-11-1921-IV_BI.pdf",
    "chunk": "l Igg-Ne. Geneva, May 11th 1921, T Y ? H Tj S., cte \"b y tli g Secretary-General. The following Report \"by Dame Rachel Crowdy of the Social Section of the Secretariat, on the work of the Advisory Board of the Epidemic Commi ssirm, is circulated for the information rf the Members of the Council A list of the Members of the Advisory Board is attached. R E P O R T, The Advisory Board of the Epidemic Commission which met in Warsaw on April 15th =,, began i a work by holding two Conferences at which the Scheme of Relief undertaken at present by the Polish Health Service was clearly outlined to the Members of the Board and every possible question was invited by the ...Polish Health Authorities = It was decided not to discuss at those preliminary meetings the manner in which the leagueT s assistance could best be employed until after the Members of the Advisory Board had had an opportunity of seeing what had already been done in Poland and Lithuania, Before leaving Warsaw we had an opportunity of inspecting a large Lelousing Station and of seeing a big Epidemic Hospital in Warsaw itself. A special Railway"
  },
  {
    "title": "C-23-M-11-1921-IV_BI.pdf",
    "chunk": "carriage was put at our disposal by the Polish Military Authorities in which we left Warsaw and proceeded via Brest-Litowsk to our first stopping place Baranovitchi, seven kilometres from the Soviet frontier. Here there was an enormous quarantine Station divided into two parts vis Military and Civilian, with one common division for both /parts parts consisting of the admission rooms general bathing establishment and delousing plantc The Military Division deals with Bolshevik prisoners on their way from concentration camps in Poland to Russia as wall as with Polish prisoners of War returning from Russia, The Military division consisted of a Barracks for the Soldiers and a Military Hospital of 6C0 beds, The Civilian division consisted of Barracks for some 8,Coo persons and an epidemic hospital with 300 beds This camp has only been completed during the last few weeks and up to the present time has dealt with about 9,000 Bolshevik and 3,000 Polish Prisoners c War. Each returning prisoner or emigrant goes through a process of delousing and quarantine, and has completely fresh underwear issued to him thereby safeguarding to some extent, the health of the country to which he is proceeding. There are also for use in the"
  },
  {
    "title": "C-23-M-11-1921-IV_BI.pdf",
    "chunk": "camp, two Plants for steaming Railway cars in cases when infectious persons have been can led on the trainso The Advisory Board was immensely struck with the able administration of this camp and the admirable work being done there We then went on by train t Lida , and motored frwm there to see an improvised hospital in the area, which is suppose to oope with the epidemic cases within an area of 40,000 square milos, for which it is of course inadequate. Certain of the stores supplied by the League of Nations have been issued to this hospital. During the next three days we visited Vtlna C Smi An Y Zyrmhny Zoledek 0ZUIJ Seidel Grcdn Sokolka and Bialostock seeing in all, /wi thin wi thin five days, ten hospitals, twelve fixed disinfecting plants, two field disinfecting columns and two quarantine stations before returning to Warsaw,, In addition we visited many small houses and cottages in the towns and in nearly every house found persons suffering or convalescent from Typhus or relapsing fever, A further meeting of the Advisory Board was held on the evening of our return to Warsaw and a detailed plan of campaign of the"
  },
  {
    "title": "C-23-M-11-1921-IV_BI.pdf",
    "chunk": "League of Nations Epidemic Commission was discussed It was decided in view of the relatively small resources at the disposal of the League of Nations Epidemic Commission that the only v/ise policy was to assist and supplement the work at present being carried out by the Polish Governments Full equipment for fifty.50 bedded hospitals is being supplied by the League of Nations Epidemic Commission to the Polish Epidemic Commissariat, and clothes, food stuffs, transport and Medical supplies have been or are being obtained to supplement this provision The Advisory Board of the Epidemic Commission of the League of Nations passed certain resolutions which will be fbrwarded to the Secretary-General by the Cfctef Commissioner, expressing its admiration and entire approval of the efficiency and success with which the Polish Epidemic Commissariat is conducting its campaign, and concurred .in the plan of assistance to be given to the Polish Authorities by the Chief Commissioner. It was the unanimous decision of the Board that further expenditure of League funds should as far as possible be made in a way best calculated to further the continual development of the Health Organisation n f Poland. League Op Nations Epidemic Commission Advisory Board, Professor Winslow League"
  },
  {
    "title": "C-23-M-11-1921-IV_BI.pdf",
    "chunk": "of Red Cross Societies, Dr. Erick Comit International da la Croix Rouge Dr, Eerriere Comit International de la Croix Rouge, Professer Madsen Office International d'Hygiene Publique Dame Raohel Crowdy Secretariat of the League of Nations. Mic ( ( Dr. Norman YJhite ( Mission, Professor Rajchman ( Colonel Gauthier ( ( ( Major Eitzhugh Chief Commissioner of Epidemic Commission. London, Commissioner, Poland Commissioner, Poland, Commissioner, Poland"
  },
  {
    "title": "C21-68-57-1921_BI.pdf",
    "chunk": "inborn you that, in accordance with the official instructions which I have Just received, ay Government has decided to contribute a sun of 20,000 francs to the fund for the campaign against the Typhus epidemic hich is raging in the Countries of eastern marope. I beg to bring this to your notice and .nve the honour etc, (Signed) S. de la Fuente Charge d'Affaires of Peru in France. To the Secretary General of the League of Nations, Geneva. -2- ,tion of Czecho-Slovakia in Switzerland. Borne, Communicated to McMonnet by the Czecho-Slovak. Mi nis t er in 3 e rn e. 12. 2. 1921. Sir , In his tele gran of December 18 th, 1920, the President of the Assembly of the League of Eat ions at Geneva was good enough to solicit the assistance of the Czecho-Slovak Ministry for Foreign Affairs in the campaign against the epidemic of Eruptive Typhus which continues to menace Eastern Europe and especially Poland. On receipt of this telegram the Czecho-Slovak Ministry for Foreign Affairs at once considered in what manner and to what extent it w^s possible to carry out this request. It immediately consulted the other competent Ministries, especially those of"
  },
  {
    "title": "C21-68-57-1921_BI.pdf",
    "chunk": "Health and Finance in order to nuke a thorough enquiry into this matter. I have the honour to draw your attention to the fact th^t, since the appearance of this epidemic, the Czecho-Slovak Republic has also suffered from it considerably on account of the extent of its Eastern frontiers. It has endeavoured to the best of its means to prevent the progress of this disease and hitherto these efforts have been crowned with complete success. The Czecho-Slovak Government has te en effectually assisted in this task by the Czeono-Slovak Red Cross and thanxs to those united Efforts they have been able to check the spread of the epidemic The campaign against Eruptive Typhus was waged during' the whole of 1920 throughout the Czecho-Slovak Republic by means of very stringent sanitary control as well as by the creation of indppend ent sanitary stations and camps, notably in Slovakia. The enormous expenditure incurred on account of these measures W .S *- was 1301716 by tho State, by the Local Authorities and by private Associ t ions. By these means tho tate has succeeded, and continues to succeed, in preventing the epidemic from spreading through Czecho-Slovak territory and \"thus reaching '.'os\\ em nuropo. The"
  },
  {
    "title": "C21-68-57-1921_BI.pdf",
    "chunk": "Official Gazette of the Czecho-Slovak Ministry of Health has, however, reported - and unfort unate ly still has to report - I isolates Cases of eruptive Typhus, which for the most part are imported from Boland into Czecho-Slovam territory, 'where they receive every attention, in order that all danger 01 infection may be removed. The peculiar geographical situation of the Czecho-Slovak 9 Republic must be taken into consideration, aS its eastern Frontier adjoins territory where hygienic conditions, especially in respect I of infectious diseases, are not favourable, and -..hich therefore B constitute an everpprosont menace. Thus on the Czecho-Slovak Republic rests the duty of acting as a barrier between Rast and West. The state Budget for 1921 provides a sum of 5,100,000 [Czecho-Slovak Crowns as the absolute minimum for the campaign against epidemics, and especially against Typhus. This sun will bo loxpendoc Ki the Ca chiefly in Slovakia and in the Ruthenian territory South iputhians (Trans-Carpathian Russia) and it is impossible ko employ even the smallest part of this sum fort the campaign against typhus outside our own frontiers. After all the expenses already Incurred, and in view of tne new expenditure anticipated, all of I"
  },
  {
    "title": "C21-68-57-1921_BI.pdf",
    "chunk": "hich is borne by the Czecho-olotak at^ie am by its Local Authorities ithout foreign assisturce, the Czocho-blovan Republic may itself lequire a grant from the more fortunate States for this very purpose. All the Mihistries agree tn at the Czecho-Slovak Republic |Bist prevent the spread of epidemic Typhus from Last to .est, ^*e State itself is doing its utmost to resist invasion by Il suc h such diseases The Ministry of Finance recognises the necessity of using every means of checking. the spread from the Lust of the Eruptive Typhus epidemic, and is of opinion that the Czecho slovak Republic is fulfilling its obligation by making every effort to prevent any possibility of the spread of Typhus in its own territory and towards the . 'est. As will be seen from the reasons adduced above, the Czech o-Slovek Republic, under present circumstances, is already exhausted by its expenditure in the Campaign against araptive Typhus from outside, and cannot therefore taxe part in general subscriptions for the extermination of this disease in Eastern Europe. Nevertheless the Czecho-Slovak Government assures the Secretary General of the League of Nations that it will consider its chief duty towards humanity to lie in doing"
  },
  {
    "title": "C21-68-57-1921_BI.pdf",
    "chunk": "everything in its power to this end, as soon as its own territory has ceeased to be ovsrtr-run by Typhus from across its Eastern frontiers. I have the honour to be etc., (Signed) Dr. Cyrill Dusok. Pzecho-Slovak Minister, Delegate to the Assembly of the League of Nations. Berne , February 2nd, 1921, Brie Drummond re.bary General -io of Nations ,"
  },
  {
    "title": "C_1920_20_4_315_BI.pdf",
    "chunk": "Of a Ati Oms Sunderland Honae Curaori Street .t-oxidon, W.l, 16th C'ctober 1919 rr.'Hjg ni polind Letter dat e. mgiist 7, 192G, from The Belgian &baenador ir_ London * Belgian Embassy London. August 7, 1920. . Sir, In a communication dated July 20th last, (No, 12/4718/1719) you enquired whether the Belgian Govormont had. ooiae to a decision with regard to the appeal addressed to it by the Council of the League of I Nations at its Lejting in Eome, in ordei- to obtain funds for prophylactic measures against ths spread of typhus in Poland and the neighbouring Countries, I have Just been instructed by rzy Government to inform you that Belgium is prepared to grant the sum of - >1,000 towards tho expenditure referred to. In conveying this information, the Prime Minister , Ii, Delacroix, adds that the condition of the finances of the Belgian State does not perr.it of a more ocnoiderable grant being contemplated. I have the honour to be, Sir, etc,, (Signed) B, L.Oncesun,"
  },
  {
    "title": "A-57-1920_BI.pdf",
    "chunk": "l' pid mie au point de vue conomique et en ce qui concerne la sant publique. Ces appels ont eu, jusqu' pr sent, peu de succ s et c'est pour cette raison que le Conseil a d cid de renvoyer la question l'Assembl e. League Of Nations Typhus In Poland. Memorandum by the Secretary-General. At the Council Meeting on October 20th held In Brussels, the Council unani mously decided to refer the question of raising funds for the campaign against typhus in Poland to the Assembly, with whom will lie the responsibility of deciding whether it be possible to raise 2,000,000 immediately from the combined countries present at the Assembly, or whether it is to be announced that the scheme is a failure, the campaign undertaken by the League of Nations unneces sary, and the countries unable to produce the money for such a purpose. The Council also requested the Secretary-General to invite two eminent medical men to proceed at once to Poland with the Chief Medical Commissioner for the Typhus Campaign, and to present in person a Report to the Assembly as to the exact epidemic condition in Poland, The following distinguished medical men were therefore approached, and consented to undertake this Mission in"
  },
  {
    "title": "A-57-1920_BI.pdf",
    "chunk": "company with Dr. Norman White, Chief Medical Commissioner for Typhus : Dr. Madsen, President of the Serum Institute at Copenhagen. (Nomi nated with the official consent of the Danish Government). Dr. Pottevin (Office International d'Hygiene Publique), Member of the temporary Committee of Experts, which undertook at the Meeting of the International Health Conference to place its ser vices at the disposal of the League of Nations if required. This Report is laid before the Assembly for the consideration of its Members. The Members of the Commission have also agreed to appear as witnesses before the Committee considering the question. This campaign against typhus was first undertaken on the recommenda tions of the International Health Conference (constituted under the Resolution of the Council), many public health men and epidemiologists being among those who put forward the Report to the Council. Subsequently three appeals were issued by the Council to the Great Powers, and to all other nations, strongly urging the responsibilities of all countries from the point of view of economic, humanitarian and direct danger. These appeals have up to the present met with little response, and it is for this reason that the Council decided to refer the question to"
  },
  {
    "title": "A-57-1920_BI.pdf",
    "chunk": "the Assembly. ' Librab Y Archives jr \" * / League of Rations Geneva. C I R C U L A R . The Director of the Internal Services of the Secretariat of the League of Nations has the honour to inform the Members of the Delegations to the Assembly of the League of Mations, that the opening of the Assembly will take place in the Assembly Hall, situated in the Boulevard Helvetique (front entrance) and the rue du Rhone and the rue Versonnex (lateral entrances} at 11 o'clock on Monday morning, November 15th. The entrance of the Delegations will be at one of the two lateral entrances to the Hall. As stated in a previous circular, the tickets for the Delegations will be delivered at the Delegations' Building, 3 rue du Mont Blanc, Room 10. The office will be open on Sunday, the l thj Erik Co Lb An. 13th November 1920"
  }
]